In [1]:
import pandas as pd
import numpy as np

# Add New Column

In [2]:
x=np.arange(0,16).reshape(4,4)
x

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [3]:
df=pd.DataFrame(data=x,columns=['Col1','Col2','Col3','Col4'])
df

   Col1  Col2  Col3  Col4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15

In [4]:
df['Sum_Col']=df['Col1']+df['Col2']+df['Col3']+df['Col4']
df

   Col1  Col2  Col3  Col4  Sum_Col
0     0     1     2     3        6
1     4     5     6     7       22
2     8     9    10    11       38
3    12    13    14    15       54

In [5]:
df['Col5']=np.arange(16,20)
df

   Col1  Col2  Col3  Col4  Sum_Col  Col5
0     0     1     2     3        6    16
1     4     5     6     7       22    17
2     8     9    10    11       38    18
3    12    13    14    15       54    19

In [6]:
df['Col6']=[20,21,22,23]
df

   Col1  Col2  Col3  Col4  Sum_Col  Col5  Col6
0     0     1     2     3        6    16    20
1     4     5     6     7       22    17    21
2     8     9    10    11       38    18    22
3    12    13    14    15       54    19    23

# Remove Rows & Columns

In [7]:
df.drop(['Col6'],axis=1)

   Col1  Col2  Col3  Col4  Sum_Col  Col5
0     0     1     2     3        6    16
1     4     5     6     7       22    17
2     8     9    10    11       38    18
3    12    13    14    15       54    19

In [8]:
df.drop(['Col4'],axis=1,inplace=True)
df

   Col1  Col2  Col3  Sum_Col  Col5  Col6
0     0     1     2        6    16    20
1     4     5     6       22    17    21
2     8     9    10       38    18    22
3    12    13    14       54    19    23

In [10]:
df.drop([1,3],axis=0,inplace=True)
df

   Col1  Col2  Col3  Sum_Col  Col5  Col6
0     0     1     2        6    16    20
2     8     9    10       38    18    22

# Check for Null Values

In [14]:
df1=pd.DataFrame({'Col1':[1,2,np.NaN,4,5,np.NaN,7],
                 'Col2':[10,42,68,np.NaN,np.NaN,80,np.NaN],
                 'Col3':['Nep','Ind','Usa','Pak','Chn','Aus','Ger']})
df1

   Col1  Col2 Col3
0   1.0  10.0  Nep
1   2.0  42.0  Ind
2   NaN  68.0  Usa
3   4.0   NaN  Pak
4   5.0   NaN  Chn
5   NaN  80.0  Aus
6   7.0   NaN  Ger

In [15]:
df1.isnull()

    Col1   Col2   Col3
0  False  False  False
1  False  False  False
2   True  False  False
3  False   True  False
4  False   True  False
5   True  False  False
6  False   True  False

In [16]:
df1.isnull().sum()

Col1    2
Col2    3
Col3    0
dtype: int64

In [21]:
df1.isnull().sum()/(len(df1))*100

Col1    28.571429
Col2    42.857143
Col3     0.000000
dtype: float64

In [22]:
df1.notnull()

    Col1   Col2  Col3
0   True   True  True
1   True   True  True
2  False   True  True
3   True  False  True
4   True  False  True
5  False   True  True
6   True  False  True

In [23]:
df1.notnull().sum()

Col1    5
Col2    4
Col3    7
dtype: int64

In [24]:
df1.notnull().sum()/len(df1)*100

Col1     71.428571
Col2     57.142857
Col3    100.000000
dtype: float64

In [26]:
df1['Col2'].notnull()

0     True
1     True
2     True
3    False
4    False
5     True
6    False
Name: Col2, dtype: bool

In [28]:
df1.isnull().any(axis=1)

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [29]:
df1[df1.isnull().any(axis=1)]

   Col1  Col2 Col3
2   NaN  68.0  Usa
3   4.0   NaN  Pak
4   5.0   NaN  Chn
5   NaN  80.0  Aus
6   7.0   NaN  Ger

In [32]:
df1[df1.notnull().all(axis=1)]

   Col1  Col2 Col3
0   1.0  10.0  Nep
1   2.0  42.0  Ind

# Drop Null Values

In [33]:
df1.dropna()

   Col1  Col2 Col3
0   1.0  10.0  Nep
1   2.0  42.0  Ind

In [35]:
df1.dropna(axis=1)

  Col3
0  Nep
1  Ind
2  Usa
3  Pak
4  Chn
5  Aus
6  Ger

In [36]:
df1.dropna(axis=1,how='all')

   Col1  Col2 Col3
0   1.0  10.0  Nep
1   2.0  42.0  Ind
2   NaN  68.0  Usa
3   4.0   NaN  Pak
4   5.0   NaN  Chn
5   NaN  80.0  Aus
6   7.0   NaN  Ger

# Fill Null Values

In [38]:
df1.fillna(100)

    Col1   Col2 Col3
0    1.0   10.0  Nep
1    2.0   42.0  Ind
2  100.0   68.0  Usa
3    4.0  100.0  Pak
4    5.0  100.0  Chn
5  100.0   80.0  Aus
6    7.0  100.0  Ger

In [41]:
df1['Col1'].mean()
df1['Col2'].mean()

50.0

In [44]:
df1.fillna(df.mean())

   Col1  Col2 Col3
0   1.0  10.0  Nep
1   2.0  42.0  Ind
2   4.0  68.0  Usa
3   4.0   5.0  Pak
4   5.0   5.0  Chn
5   4.0  80.0  Aus
6   7.0   5.0  Ger

In [45]:
df1['Col1'].fillna(df['Col2'].mean())

0    1.0
1    2.0
2    5.0
3    4.0
4    5.0
5    5.0
6    7.0
Name: Col1, dtype: float64

In [50]:
df1['Col3'][1::2]=np.NaN

C:\Users\Admin\AppData\Local\Temp\ipykernel_2456\4043149634.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['Col3'][1::2]=np.NaN

In [51]:
df1

   Col1  Col2 Col3
0   1.0  10.0  Nep
1   2.0  42.0  NaN
2   NaN  68.0  Usa
3   4.0   NaN  NaN
4   5.0   NaN  Chn
5   NaN  80.0  NaN
6   7.0   NaN  Ger

In [52]:
df1['Col3'].fillna('Country')

0        Nep
1    Country
2        Usa
3    Country
4        Chn
5    Country
6        Ger
Name: Col3, dtype: object

In [53]:
df1['Col3'].fillna(method='ffill')

C:\Users\Admin\AppData\Local\Temp\ipykernel_2456\2046090927.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df1['Col3'].fillna(method='ffill')

0    Nep
1    Nep
2    Usa
3    Usa
4    Chn
5    Chn
6    Ger
Name: Col3, dtype: object

In [57]:
df1['Col3'].fillna(method='bfill')

C:\Users\Admin\AppData\Local\Temp\ipykernel_2456\2699718841.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df1['Col3'].fillna(method='bfill')

0    Nep
1    Usa
2    Usa
3    Chn
4    Chn
5    Ger
6    Ger
Name: Col3, dtype: object

In [58]:
df1['Col3'].fillna(method='pad')

C:\Users\Admin\AppData\Local\Temp\ipykernel_2456\2563765098.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df1['Col3'].fillna(method='pad')

0    Nep
1    Nep
2    Usa
3    Usa
4    Chn
5    Chn
6    Ger
Name: Col3, dtype: object

# Set Index

In [61]:
np.random.seed(101)
df2=pd.DataFrame(data=np.random.randn(5,5),index='a b c d e'.split(),columns='col1 col2 col3 col4 col5'.split())
df2

       col1      col2      col3      col4      col5
a  2.706850  0.628133  0.907969  0.503826  0.651118
b -0.319318 -0.848077  0.605965 -2.018168  0.740122
c  0.528813 -0.589001  0.188695 -0.758872 -0.933237
d  0.955057  0.190794  1.978757  2.605967  0.683509
e  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [62]:
df2.reset_index()

  index      col1      col2      col3      col4      col5
0     a  2.706850  0.628133  0.907969  0.503826  0.651118
1     b -0.319318 -0.848077  0.605965 -2.018168  0.740122
2     c  0.528813 -0.589001  0.188695 -0.758872 -0.933237
3     d  0.955057  0.190794  1.978757  2.605967  0.683509
4     e  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [64]:
df2.reset_index(drop=True)

       col1      col2      col3      col4      col5
0  2.706850  0.628133  0.907969  0.503826  0.651118
1 -0.319318 -0.848077  0.605965 -2.018168  0.740122
2  0.528813 -0.589001  0.188695 -0.758872 -0.933237
3  0.955057  0.190794  1.978757  2.605967  0.683509
4  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [65]:
players='Messi Ronaldo Neymar Hazard Reus'.split()
df2['Col6']=players
df2

       col1      col2      col3      col4      col5     Col6
a  2.706850  0.628133  0.907969  0.503826  0.651118    Messi
b -0.319318 -0.848077  0.605965 -2.018168  0.740122  Ronaldo
c  0.528813 -0.589001  0.188695 -0.758872 -0.933237   Neymar
d  0.955057  0.190794  1.978757  2.605967  0.683509   Hazard
e  0.302665  1.693723 -1.706086 -1.159119 -0.134841     Reus

In [68]:
df2.set_index('Col6',inplace=True)

In [69]:
df2

             col1      col2      col3      col4      col5
Col6
Messi    2.706850  0.628133  0.907969  0.503826  0.651118
Ronaldo -0.319318 -0.848077  0.605965 -2.018168  0.740122
Neymar   0.528813 -0.589001  0.188695 -0.758872 -0.933237
Hazard   0.955057  0.190794  1.978757  2.605967  0.683509
Reus     0.302665  1.693723 -1.706086 -1.159119 -0.134841